app/views/reservations/index.html.erb

        <td><%= reservation.code %></td>
        <td><%= reservation.guest.first_name %> <%= reservation.guest.last_name %></td>
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1