app/views/reservations/show.html.erb

SELECT "guests".* FROM "guests" WHERE "guests"."id" = 1 LIMIT 1
---
<ul class="list-group">
  <li class="list-group-item"><strong>Guest:</strong> <%= @reservation.guest.first_name %> <%= @reservation.guest.last_name %></li>