app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = 1 LIMIT 1